testing/jmeter/stress_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  ============================================================
  JMETER TEST PLAN - STRESS TESTING
  Notes App UKPL
  ============================================================

  Stress Test: Temukan titik BATAS MAKSIMAL server dengan
  menaikkan jumlah user secara bertahap sampai sistem gagal.

  CARA MENJALANKAN:
  jmeter -n -t stress_test.jmx -l hasil_stress_test.jtl -e -o report_stress/

  SKENARIO STEP (Ultimate Thread Group):
  Step 1:  50  user  → bertahan 60 detik
  Step 2:  100 user  → bertahan 60 detik
  Step 3:  200 user  → bertahan 60 detik
  Step 4:  500 user  → bertahan 60 detik  ← kemungkinan mulai gagal
  Step 5: 1000 user  → bertahan 60 detik  ← titik batas

  CATATAN: Stress test sengaja memaksa kegagalan.
  Error rate tinggi di step akhir adalah EXPECTED BEHAVIOR.
  ============================================================
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>

    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="[STRESS TEST] Notes App - Temukan Batas Maksimal" enabled="true">
      <stringProp name="TestPlan.comments">
        Stress Test Notes App UKPL
        Skenario: Naik bertahap 50 → 100 → 200 → 500 → 1000 user
        Tujuan: Temukan titik dimana server mulai gagal
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">3001</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ===== HTTP DEFAULT CONFIG ===== -->
      <ConfigTestElement guiclass="HttpDefaultsGui"
                         testclass="ConfigTestElement"
                         testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
        <stringProp name="HTTPSampler.port">${PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- ===== HEADER MANAGER ===== -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                     testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>


      <!-- ===================================================
           STEP 1: 50 User Concurrent (Baseline)
           =================================================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="STEP-1: 50 User (Baseline Normal)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">5</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor"
                            testname="Setup: Register User Step 1" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
            def username = "stress1_" + System.currentTimeMillis() + "_" + ctx.getThreadNum()
            vars.put("ST_USER", username)
            vars.put("ST_PASS", "stress123")

            // Register user
            def http = new URL("http://localhost:3001/register").openConnection()
            http.setRequestMethod("POST")
            http.setDoOutput(true)
            http.setRequestProperty("Content-Type", "application/json")
            http.outputStream.write(("""{"username":"${username}","password":"stress123"}""").bytes)
            http.inputStream.text // consume response

            // Login dan ambil token
            def loginHttp = new URL("http://localhost:3001/login").openConnection()
            loginHttp.setRequestMethod("POST")
            loginHttp.setDoOutput(true)
            loginHttp.setRequestProperty("Content-Type", "application/json")
            loginHttp.outputStream.write(("""{"username":"${username}","password":"stress123"}""").bytes)
            def loginResp = loginHttp.inputStream.text
            def tokenMatch = loginResp =~ /"token":"([^"]+)"/
            if (tokenMatch.find()) {
              vars.put("STRESS_TOKEN", tokenMatch.group(1))
            }
          </stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="ST1: GET /notes" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/notes</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                         testname="Auth Header" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${STRESS_TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="ST1: POST /notes" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{"judul":"Stress Step1 Thread${__threadNum}","isi":"Stress test catatan"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/notes</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                         testname="Auth Header" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${STRESS_TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>


      <!-- ===================================================
           STEP 2: 100 User
           =================================================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="STEP-2: 100 User" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">5</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">15</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <stringProp name="ThreadGroup.delay">70</stringProp>  <!-- Mulai setelah Step 1 (60+10s) -->
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor"
                            testname="Setup: Register User Step 2" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
            def username = "stress2_" + System.currentTimeMillis() + "_" + ctx.getThreadNum()
            vars.put("ST_USER", username)

            def http = new URL("http://localhost:3001/register").openConnection()
            http.setRequestMethod("POST")
            http.setDoOutput(true)
            http.setRequestProperty("Content-Type", "application/json")
            http.outputStream.write(("""{"username":"${username}","password":"stress123"}""").bytes)
            http.inputStream.text

            def loginHttp = new URL("http://localhost:3001/login").openConnection()
            loginHttp.setRequestMethod("POST")
            loginHttp.setDoOutput(true)
            loginHttp.setRequestProperty("Content-Type", "application/json")
            loginHttp.outputStream.write(("""{"username":"${username}","password":"stress123"}""").bytes)
            def loginResp = loginHttp.inputStream.text
            def tokenMatch = loginResp =~ /"token":"([^"]+)"/
            if (tokenMatch.find()) {
              vars.put("STRESS_TOKEN", tokenMatch.group(1))
            }
          </stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="ST2: GET /notes" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/notes</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                         testname="Auth Header" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${STRESS_TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="ST2: POST /notes" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{"judul":"Stress Step2 Thread${__threadNum}","isi":"Stress test step 2"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/notes</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                         testname="Auth Header" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${STRESS_TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>


      <!-- ===================================================
           STEP 3: 200 User
           =================================================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="STEP-3: 200 User" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">5</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <stringProp name="ThreadGroup.delay">145</stringProp>  <!-- Delay setelah Step 2 selesai -->
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor"
                            testname="Setup: Register User Step 3" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
            def username = "stress3_" + System.currentTimeMillis() + "_" + ctx.getThreadNum()
            vars.put("ST_USER", username)

            def http = new URL("http://localhost:3001/register").openConnection()
            http.setRequestMethod("POST")
            http.setDoOutput(true)
            http.setRequestProperty("Content-Type", "application/json")
            http.outputStream.write(("""{"username":"${username}","password":"stress123"}""").bytes)
            try { http.inputStream.text } catch(e) {}

            def loginHttp = new URL("http://localhost:3001/login").openConnection()
            loginHttp.setRequestMethod("POST")
            loginHttp.setDoOutput(true)
            loginHttp.setRequestProperty("Content-Type", "application/json")
            loginHttp.outputStream.write(("""{"username":"${username}","password":"stress123"}""").bytes)
            try {
              def loginResp = loginHttp.inputStream.text
              def tokenMatch = loginResp =~ /"token":"([^"]+)"/
              if (tokenMatch.find()) { vars.put("STRESS_TOKEN", tokenMatch.group(1)) }
            } catch(e) { vars.put("STRESS_TOKEN", "FAILED") }
          </stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="ST3: GET /notes" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/notes</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                         testname="Auth Header" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${STRESS_TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="ST3: POST /notes" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{"judul":"Stress Step3 Thread${__threadNum}","isi":"Stress test 200 user"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/notes</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                         testname="Auth Header" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${STRESS_TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>


      <!-- ===== LISTENERS ===== -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                       testname="Summary Report - Stress Test" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">hasil_stress_test.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                       testname="Aggregate Report - Stress Test" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector"
                       testname="View Results Tree (Error Only)" enabled="true">
        <boolProp name="ResultCollector.error_logging">true</boolProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>